package com.yedam.example2;

public  class Question {
	//필드
//	문제) 플레이어가 있고 이플레이어가 게임을 합니다.
//		게임에서 플레이어가 가지는 레벨에 따라 할 수 있는 세가지 기능이 있습니다.
	// 초보자 레벨 : 천천히 달릴(run) 수 있습니다
	// 중급자 레벨 : 빠르게 달릴(run) 점프할(jump) 있습니다
	//	고급자 레벨 : 엄청 빠르게 달리고 점프하고 턴(turn)할 수 있습니다.
	
	//모든 레벨에서 플레이어가 사용할 수 있는 필살기인 go(int count)메서드를 제공합니다
	//go()메서드는 한번 run 하고 매개변수로 전달된 count만큼 jump 하고 한번 turn합니다
	//그레벨에서 불가능한 기능을 요청하면 할 수 없다는 메세지를 출력합니다
	//생성자
	
	//메소드
	
	//출력결과 beginner : go(1),
	// adavanced : go(2)
	// super : go(3)

}
